export default function Home() {
  return (
    <main className="flex min-h-screen p-24">
      <div className="z-10 max-w-5xl w-full font-mono lg:flex lg:flex-col lg:justify-start lg:items-end lg:mx-auto">
        <div className="mb-16 text-right">
          <h1 className="mb-4 font-bold text-2xl">درباره‌ی ما</h1>
          <p className="text-lg">
            شبکه ایرانیان دیاسپورا یک نهاد سیاسی-اجتماعی، غیرانتفاعی، و غیر‌حزبی
            است که با هم‌گرایی افراد و نهادهایی با گرایش‌های مختلف شکل می‌گیرد.
            اهداف اصلی این شبکه ترویج تنوع و دیگر پذیری در جامعه‌ی ایران، حمایت
            از دموکراسی، جلوگیری از دیگر‌ستیزی، و همکاری با نیروهای دیگر‌پذیر
            برای تحقق اهداف دموکراتیک است. این شبکه از افراد با گرایشات و
            اعتقادات مختلف، اعم ازپادشاهی‌خواه یا جمهوری‌خواه، چپ یا راست،
            دین‌مدار یا بی‌دین، یا از هر تفکر و گرایش دیگری تشکیل شده که با
            فعالین داخل ایران در راستای تحولات سیاسی و اجتماعی در کشور همراهی و
            همکاری دارد.
          </p>
        </div>
        <div className="mb-16 text-right">
          <h1 className="mb-4 font-bold text-2xl">چشم انداز</h1>
          <p className="text-lg">
            شبکه ایرانیان دیاسپورا برای رسیدن به ایرانی آزاد و مستقل تلاش
            می‌کند؛ جایی که در آن همه‌ی نیروهای توانمند دیاسپورای ایرانی ‌و
            نهادهای سیاسی، مدنی، و صنفی، آزادانه، فعالانه، با همبستگی و آگاهی
            سیاسی و اجتماعی کافی، و تکیه بر اصول مشترک دموکراتیک، فارغ از موافقت
            یا مخالفت‌شان با هم و یا با دولت، مقاومت مردم ایران را در مقابل
            هرگونه سرکوب تقویت می‌کنند و با یکدیگر همکاری می‌کنند.
          </p>
        </div>
      </div>
    </main>
  );
}
