export default function Home() {
  return (
    <main className="flex min-h-screen px-4 py-8 lg:p-24">
      <div className="z-10 max-w-5xl w-full font-mono lg:flex lg:flex-col lg:justify-start lg:items-end lg:mx-auto">
        <div className="mb-16 text-right">
          <h1 className="mb-4 font-bold text-2xl">درباره‌ی ما</h1>
          <p className="text-lg">
            شبکه ایرانیان دیاسپورا یک نهاد سیاسی-اجتماعی، غیرانتفاعی، و غیر‌حزبی
            است که با هم‌گرایی افراد و نهادهایی با گرایش‌های مختلف شکل می‌گیرد.
            اهداف اصلی این شبکه ترویج تنوع و دیگر پذیری در جامعه‌ی ایران، حمایت
            از دموکراسی، جلوگیری از دیگر‌ستیزی، و همکاری با نیروهای دیگر‌پذیر
            برای تحقق اهداف دموکراتیک است. این شبکه از افراد با گرایشات و
            اعتقادات مختلف، اعم ازپادشاهی‌خواه یا جمهوری‌خواه، چپ یا راست،
            دین‌مدار یا بی‌دین، یا از هر تفکر و گرایش دیگری تشکیل شده که با
            فعالین داخل ایران در راستای تحولات سیاسی و اجتماعی در کشور همراهی و
            همکاری دارد.
          </p>
        </div>
        <div className="mb-16 text-right">
          <h1 className="mb-4 font-bold text-2xl">چشم انداز</h1>
          <p className="text-lg">
            شبکه ایرانیان دیاسپورا برای رسیدن به ایرانی آزاد و مستقل تلاش
            می‌کند؛ جایی که در آن همه‌ی نیروهای توانمند دیاسپورای ایرانی ‌و
            نهادهای سیاسی، مدنی، و صنفی، آزادانه، فعالانه، با همبستگی و آگاهی
            سیاسی و اجتماعی کافی، و تکیه بر اصول مشترک دموکراتیک، فارغ از موافقت
            یا مخالفت‌شان با هم و یا با دولت، مقاومت مردم ایران را در مقابل
            هرگونه سرکوب تقویت می‌کنند و با یکدیگر همکاری می‌کنند.
          </p>
        </div>
        <div className="mb-16 text-right">
          <h1 className="mb-4 font-bold text-2xl">مأموریت</h1>
          <ol className="text-lg list-decimal list-inside">
            <li>
              ایجاد کانونی برای همبستگی، همگرایی، و توانمند‌سازی نهادهای
              دیگر‌‌پذیر مدنی، صنفی، و سیاسی ایرانیان دیاسپورا
            </li>
            <li>
              توافق بر سر مفاهیم بنیادی، و دستیابی به یک گفتمان مشترک دموکراتیک،
              از طریق بالا‌بردن آگاهی‌های همگانی، تعامل، و همکاری بین گروه‌های
              دموکراسی‌خواه دیاسپورا
            </li>
            <li>
              ارائه‌ی تصویری واضح، امیدبخش و سازنده از ایرانِ پسا-جمهوری اسلامی،
              برای تشویق و بکارگیری نیروها و امکانات بالقوه‌ی دیاسپورای ایرانی
              به نفع مردم داخل ایران
            </li>
            <li>
              رایزنی با سیاستمداران و دولت‌های گوناگون به منظور تاثیر‌گذاری روی
              سیاست‌های آنان برای همکاری نکردن با جمهوری اسلامی و پشتیبانی از
              خیزش‌های مردمی در ایران
            </li>
          </ol>
        </div>
        <div className="mb-16 text-right">
          <h1 className="mb-4 font-bold text-2xl">ساختار</h1>
          <p className="text-lg mb-6">
            طرح زیر، ساختار پیشنهادی شبکه ایرانیان دیاسپورا (شبکه) در دوران
            تخصص-محور است. هم‌زمان با گذار به دوران عضو-محور، این ساختار گسترش
            خواهد یافت. ساختار شبکه، در دوران تخصص-محور شامل مجمع عمومی، هیئت
            اجرایی، و کارگروه‌ها می‌شود.
          </p>
          <ol className="text-lg list-decimal custom-li">
            <li className="mb-6">
              <span className="font-bold">مجمع عمومی</span>{' '}
              <ol className="list-decimal custom-li">
                <li>
                  بالاترین نهاد تصمیم‌گیری در شبکه است که شامل همه اعضا می‌شود.
                  ۲. هیئت اجرایی
                </li>
              </ol>
            </li>
            <li className="mb-6">
              <span className="font-bold">هیئت اجرایی</span>
              <ol className="list-decimal custom-li">
                <li>
                  بالاترین نهاد اجرایی شبکه است که شامل پنج نفر می‌شود که با رای
                  مجمع عمومی برای یک سال انتخاب می‌گردند.
                </li>
                <li>
                  هیئت اجرایی مسئولیت ایجاد هماهنگی بین کارگروه‌ها،
                  تصمیم‌گیری‌های اجرایی، و پیشبرد فعالیت‌های شبکه را دارد.
                </li>
                <li>هیئت اجرایی در برابر مجمع عمومی پاسخگو است.</li>
                <li>
                  مدیریت نشست‌های مجمع عمومی به صورت چرخشی به عهده اعضای هیئت
                  اجرایی است.
                </li>
              </ol>
            </li>
            <li>
              <span className="font-bold">کارگروه‌ها</span>
              <ol className="list-decimal custom-li">
                <li>
                  کارگروه‌های اجرایی مسئول انجام اقدامات لازم برای پیشبرد اهداف
                  شبکه هستند.
                </li>
                <li>
                  تعداد و مسئولیت این کارگروه‌ها با پیشنهاد هیئت اجرایی و تصویب
                  مجمع عمومی تعیین می‌گردند.
                </li>
                <li>
                  هر عضو شبکه لازم است حداقل در یک کارگروه عضویت داشته باشد.
                  عضویت در کارگروه‌ها به دلخواه است و هر فرد می‌تواند در بیش از
                  یک کارگروه عضو شود.
                </li>
                <li>
                  هر کارگروه توسط یک مدیر که از سوی هیئت اجرایی منصوب می‌شود
                  اداره می‌گردد.
                </li>
              </ol>
            </li>
          </ol>
        </div>
        <div className="text-right">
          <h1 className="mb-4 font-bold text-2xl">ارزش‌های پیشنهادی</h1>
          <p className="text-lg mb-6">
            ما معتقدیم رمز بقا، قدرت‌یابی و نفوذ یک شبکه در پای‌بندی به اصول و
            ارزش‌هایی است که بر مبنای آن ایجاد شده است. از این رو، شبکه ایرانیان
            دیاسپورا، اصول و ارزش‌های زیر را برای اداره سالم، کارا و مستمرِ این
            مجموعه تعیین کرده است که پذیرش و رعایت این اصول و ارزش‌ها، شرط حضور
            و مشارکت در این شبکه محسوب می‌شود:
          </p>
          <ol className="text-lg list-decimal list-inside">
            <li>دموکراتیک بودن</li>
            <li>مشارکت‌پذیری</li>
            <li>شفافیت</li>
            <li>پاسخگویی</li>
            <li>مسئولیت‌پذیری </li>
            <li>عدم تبعیض</li>
            <li>مشروعیت</li>
            <li>استقلال</li>
          </ol>
        </div>
      </div>
    </main>
  );
}
